import React from 'react'

function Diff() {
  return (
    <div>
        <h1>Производные</h1>
        <p>
          Произво́дная функции — понятие дифференциального исчисления, характеризующее скорость изменения функции в данной точке. Определяется как предел отношения приращения функции к приращению её аргумента при стремлении приращения аргумента к нулю, если такой предел существует. Функцию, имеющую конечную производную (в некоторой точке), называют дифференцируемой (в данной точке).

          Процесс вычисления производной называется дифференци́рованием. Обратный процесс — нахождение первообразной — интегрирование.

          В классическом дифференциальном исчислении производная чаще всего определяется через понятие предела, однако исторически теория пределов появилась позже дифференциального исчисления. Исторически производная вводилась кинематически (как скорость) или геометрически (определяясь по сути наклоном касательной, в разных конкретных формулировках). Ньютон называл производную флюксией, обозначая точкой над символом функции, школа Лейбница предпочитала в качестве базового понятия дифференциал[1].

          Русский термин в форме «производная функция» впервые употребил В. И. Висковатов, переведя на русский язык соответствующий французский термин dérivée, используемый французским математиком Лагранжем[2].


        </p>

    </div>
  )
}

export default Diff