import React from 'react'

function Droby() {
  return (
      <div>
        <h1>Дроби с нуля</h1>
        Сложение дробей бывает двух видов:

Сложение дробей с одинаковыми знаменателями;
Сложение дробей с разными знаменателями.
Сначала изýчим сложение дробей с одинаковыми знаменателями. Тут всё просто. Чтобы сложить дроби с одинаковыми знаменателями, нужно сложить их числители, а знаменатель оставить без изменения.

Например, слóжим дроби  две четвертых  и  143. Складываем числители, а знаменатель оставляем без изменения:

121241434

Этот пример можно легко понять, если вспомнить про пиццу, которая разделена на четыре части. Если к  две четвертых пиццы прибавить 143 пиццы, то получится 1224143434 пиццы:

две четверти плюс четверть равно три четверти

Пример 2. Сложить дроби одна вторая и одна вторая .

Опять же складываем числители, а знаменатель оставляем без изменения:

122121222

В ответе получилась неправильная дробь 1221212222.  Если наступает конец задачи, то от неправильных дробей принято избавляться. Чтобы избавится от неправильной дроби, нужно выделить в ней целую часть. В нашем случае целая часть выделяется легко — два разделить на два будет один:

1221212223

Этот пример можно легко понять, если вспомнить про пиццу, которая разделена на две части. Если к одна вторая пиццы прибавить еще одна вторая пиццы, то получится одна целая пицца:

половина плюс половина равно целая рисунок

Пример 3. Сложить дроби  1231313231  и  1231313231 .

Опять же складываем числители, а знаменатель оставляем без изменения:

1231313232

Этот пример можно легко понять, если вспомнить про пиццу, которая разделена на три части. Если к 1231313231 пиццы прибавить ещё 1231313231 пиццы, то получится 1231313234 пиццы:

треть плюс треть равно две трети рисунок

Пример 4. Найти значение выражения  1241424341

Этот пример решается точно также, как и предыдущие. Числители необходимо сложить, а знаменатель оставить без изменения:

124142434124

Попробуем изобразить наше решение с помощью рисунка. Если к одна четвертая пиццы прибавить две четвертых пиццы и ещё прибавить три четвёртых пиццы, то получится 1 целая и ещё две четвертых пиццы.

треть плюс треть равно две трети рисунок

Как видите в сложении дробей с одинаковыми знаменателями нет ничего сложного. Достаточно понимать следующие правила:

Чтобы сложить дроби с одинаковыми знаменателями, нужно сложить их числители, а знаменатель оставить без изменения;
Если в ответе получилась неправильная дробь, то нужно выделить в ней целую часть.

      </div>
  )
}

export default Droby